"""
4.  Написать программу, в которой реализовать две функции.
    В первой должен создаваться простой текстовый файл. Если
    файл с таким именем уже существует, выводим соответствующее
    сообщение. Необходимо открыть файл и подготовить два списка:
    с текстовой и числовой информацией. Для создания списков
    использовать генераторы. Применить к спискам функцию zip().
    Результат выполнения этой функции должен должен быть
    обработан и записан в файл таким образом, чтобы каждая строка
    файла содержала текстовое и числовое значение. Вызвать вторую
    функцию. В нее должна передаваться ссылка на созданный файл.
    Во второй функции необходимо реализовать открытие файла и простой
    построчный вывод содержимого. Вся программа должна запускаться по
    вызову первой функции.
"""


def prepare_file():

    spam = 'text.txt'
    text_list = [chr(i) for i in range(97, 123)]

    print(chr(91))
    print(ord('A'))
    print(ord('Z'))

    # pass

prepare_file()