"""
5.  Реализовать расчет цены товара со скидкой. Величина скидки
    должна передаваться в качестве аргумента в дочерний класс.
    Выполнить перегрузку методов конструктора дочернего класса
    (метод init, в который должна передаваться переменная — скидка),
    и перегрузку метода str дочернего класса. В этом методе должна
    пересчитываться цена и возвращаться результат — цена товара со скидкой.
    Чтобы все работало корректно, не забудьте инициализировать дочерний и
    родительский классы (вторая и третья строка после объявления дочернего класса).
"""


pass
